# MainWindowExtents Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIApplication..::..MainWindowExtents Property
UIApplication Class See Also
---
Get the rectangle that represents the screen pixel coordinates of the Revit main window.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public virtual Rectangle MainWindowExtents { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property MainWindowExtents As Rectangle
	Get
```

Visual C++
---
```text
public:
virtual property Rectangle^ MainWindowExtents {
	Rectangle^ get ();
}
```

# See Also
UIApplication Class
Autodesk.Revit.UI Namespace